{
  "jobTitle": [{
    "id": "40af75b0-43da-11e8-8421-06fdf93a68d5",
    "created_at": "Thu Apr 19 14:02:55 UTC 2018",
    "title": "Lead Software Engineer/Architect",
    "location": "New York, NY",
    "type": "Full Time",
    "description": "<p><strong>Overview:</strong></p>\n\n<p>The Expert…",
    "how_to_apply": "<p>You can apply on our Company website:</p>\n\n<p><a href=…",
    "company": "The Expert Institute",
    "company_url": "https://www.theexpertinstitute.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/3510b2f0-43da-11e8-8cd8-a829b89239c9.png",
    "url": "http://jobs.github.com/positions/40af75b0-43da-11e8-8421-06fdf93a68d5"
  },
    {
      "id": "b6267848-433a-11e8-998a-b0eef57bee5c",
      "created_at": "Wed Apr 18 19:00:39 UTC 2018",
      "title": "Systems Engineer",
      "location": "Brooklyn",
      "type": "Full Time",
      "description": "<p>The Systems Engineer will get the opportunity to influence the architec…",
      "how_to_apply": "<p><a href=\"https://grnh.se/sgt7yu2#app\">https://grnh.se…",
      "company": "Jackpocket",
      "company_url": "http://Jackpocket",
      "company_logo": "http://github-jobs.s3.amazonaws.com/b05df54e-433a-11e8-8222-0ee3ea23d081.png",
      "url": "http://jobs.github.com/positions/b6267848-433a-11e8-998a-b0eef57bee5c"
    },
    {
      "id": "a8407f6c-3cd2-11e8-83ff-90775e0d4f93",
      "created_at": "Tue Apr 10 15:20:10 UTC 2018",
      "title": "Senior Data Engineer",
      "location": "New York, NY, US",
      "type": "Full Time",
      "description": "<p></p><h3>About Us:</h3><p>CrowdTwist is seeking…",
      "how_to_apply": "<p><a href=\"https://www.applytracking.com/track.aspx/7fyO3\"…",
      "company": "CrowdTwist",
      "company_url": null,
      "company_logo": null,
      "url": "http://jobs.github.com/positions/a8407f6c-3cd2-11e8-83ff-90775e0d4f93"
    },
    {
      "id": "7d85a0f4-3c8c-11e8-8395-157296244b48",
      "created_at": "Tue Apr 10 06:58:46 UTC 2018",
      "title": "Software Engineering Team Lead",
      "location": "San Francisco / East Bay",
      "type": "Full Time",
      "description": "<p><strong>Customer Lobby is a start-up in downtown Berkeley, founde…",
      "how_to_apply": "<p>Email your resume to <a href=\"mailto:ahayden@customerlobby.com…",
      "company": "Customer Lobby",
      "company_url": "http://www.customerlobby.com",
      "company_logo": "http://github-jobs.s3.amazonaws.com/33d7dde6-3c8c-11e8-86ae-42eb1b0a241c.gif",
      "url": "http://jobs.github.com/positions/7d85a0f4-3c8c-11e8-8395-157296244b48"
    },
    {
      "id":"0e7b95bc-2ed4-11e8-9503-8f8dfb2ec663",
      "created_at":"Fri Mar 23 20:04:00 UTC 2018",
      "title":"AEM Developer",
      "location":"New York, NY",
      "type":"Full Time",
      "description":"<p>Deutsch New York is seeking an AEM Developer to join our growing digital team.  You will work with a dynamic group pushing boundaries for our clients.</p>\n\n<p>There's a different energy flow here at Deutsch; you'll feel it from the moment you walk in. It is what sets us apart. We behave like entrepreneurs every day, for ourselves and for our clients. We believe in business solutions, not advertising solutions.  At Deutsch, not only will you have the opportunity to work with passionate, smart people, but also to flex your entrepreneurial and independent muscles.  It's a different kind of agency.  We encourage Deutschers to challenge us to implement, execute and communicate in ways that will continue to set Deutsch above the rest.</p>\n\n<p>The AEM Developer position is recognized as a subject matter expert.  AEM component and template development, creation of OSGi bundles and services, and server setup are considered key responsibilities of this role.  The AEM Developer is responsible for assisting other developers (both front-end and back-end) with integrating their code into the AEM platform, as well as writing front-end and back-end as needed.  </p>\n\n<p><strong>WHAT YOU'D DO</strong></p>\n\n<ul>\n<li>Analysis, development, and implementation of AEM on multiple client projects</li>\n<li>AEM development and unit testing</li>\n<li>Server setup, AEM installation and deployment</li>\n<li>Collaboration with front end and back end resources</li>\n<li>Translating business needs into technical objectives</li>\n<li>Collaboration on project schedules, milestones and budgets</li>\n<li>Managing systems and processes for projects</li>\n<li>Conducting ongoing audits of systems to identify issues and opportunities for enhancements</li>\n<li>Implementing systems for improving process and reliability of managed projects</li>\n<li>Performance analysis and reporting</li>\n</ul><p><strong>WHAT YOU'VE GOT</strong>\n<em>You consider yourself a pretty well-rounded developer, and while you're an Adobe Experience Manager expert, you're comfortable up and down the stack.</em></p>\n\n<ul>\n<li>3+ years of experience in CQ5/AEM6, both working with and extending the platform</li>\n<li>3-5 years of experience in Java</li>\n<li>A full understanding of Adobe Experience Manager and underlying technologies, including CRXDELite, CRXDE, Maven, etc</li>\n<li>Advanced knowledge of responsive (and/or adaptive) techniques and frameworks</li>\n<li>Plenty of examples of your standards-compliant, modern code (and you've been around long enough to know when to ignore the standards)</li>\n<li>Experience with SASS and LESS, and you're always looking for ways to automate front-end development tasks</li>\n<li>Some experience as a developer at an advertising agency or dev shop </li>\n</ul><p><strong>On the functional side, you know how to:</strong></p>\n\n<ul>\n<li>Work both independently and as part of a multidisciplinary team</li>\n<li>Say \"yes, and\" instead of \"no, but\"</li>\n<li>Explain technical concepts in ways non-technical people can understand</li>\n<li>Communicate both in writing and verbally</li>\n</ul><p><strong>And it's a plus if you:</strong></p>\n\n<ul>\n<li>Contribute to open-source projects</li>\n<li>Are interested in AI / voice </li>\n</ul><p><em>Education: BA/BS Marketing, Communications, or other related field</em></p>\n\n<p><em>Deutsch is an equal opportunity employer.  All qualified applicants will receive consideration for the position without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.</em></p>",
      "how_to_apply":"<p>Apply on our site:</p>\n\n<p><a href=\"http://www.deutsch.com/careers/opening/xBYOX1\">http://www.deutsch.com/careers/opening/xBYOX1</a></p>",
      "company":"Deutsch",
      "company_url":"http://www.deutsch.com",
      "company_logo":"http://github-jobs.s3.amazonaws.com/57c4d3a6-2ed3-11e8-9feb-3127abef80bd.png",
      "url":"http://jobs.github.com/positions/0e7b95bc-2ed4-11e8-9503-8f8dfb2ec663"},
    {"id":"ca37951c-2dfd-11e8-93dc-7ec30e6bc6df",
      "created_at":"Fri Mar 23 18:04:21 UTC 2018",
      "title":"Software Engineer, Backend",
      "location":"Oakland",
      "type":"Full Time",
      "description":"<p><strong>Currently unable to provide relocation assistance and assistance with any type of work Visa's at the moment</strong></p>\n\n<p>We're looking for a backend engineer to help us build features, design and implement API methods, and improve the performance and reliability of our systems. We're looking for someone who knows what it takes to deliver value to customers and takes pride in the quality of their work.</p>\n\n<p>Our platform serves over twenty billion feature flags daily. The core technologies we use daily include Golang, React, Redux, MongoDB, ElasticSearch, Redis, HAProxy, and NATS.</p>\n\n<p>LaunchDarkly is a rapidly growing software company with a strong mission and vision carried out by a talented and diverse team of employees. Our goal is to help teams build better software, faster. You'll join a small team from companies like Atlassian, Intercom, and GitHub, and you'll have an immediate impact with our product and customers.</p>\n\n<p><strong>What you'll do:</strong>\nBuild and expand our APIs and services, written in Go\nCollaborate with frontend engineers to deliver user-facing features\nMonitor and improve server-side performance\nWrite unit, integration, and load tests as necessary\nActively participate in code reviews\nWrite and review technical proposals\nImprove engineering standards, tooling, and processes</p>\n\n<p><strong>Who you are:</strong>\nProven experience and fluency with server-side web development (e.g. in Java / Scala, Ruby, Python, Golang, Node.js)\nExperience building RESTful APIs\nStrong computer science fundamentals: data structures, distributed systems, concurrency, and threading\nStrong communication skills, a positive attitude, and empathy\nYou write code that can be easily understood by others, with an eye towards maintainability\nYou hold yourself and others to a high bar when working with production systems\nYou value high code quality, automated testing, and other engineering best practices</p>\n\n<p><strong>You may also know (bonus skills):</strong>\nExperience with NoSQL databases (MongoDB, ElasticSearch)\nA deep understanding of networking technologies (TCP, HTTP, websockets, server-sent events, etc.)\nAbout LaunchDarkly:</p>\n\n<p>LaunchDarkly is a Feature Management Platform that serves over 20 billion feature flags daily to help software teams build better software, faster. Feature flagging is an industry standard methodology of wrapping a new or risky section of code or infrastructure change with a flag. Each flag can easily be turned off independent of code deployment (aka ”dark launching”). LaunchDarkly has SDKs for all major web and mobile platforms. Our team culture is dynamic, friendly, and supportive.</p>\n\n<p>We are an equal opportunity employer and we strongly believe that the best teams reflect gender and ethnic diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
      "how_to_apply":"<p><a href=\"https://jobs.lever.co/launchdarkly/f8842ab1-481a-4f6e-862c-1098aba5a113\">https://jobs.lever.co/launchdarkly/f8842ab1-481a-4f6e-862c-1098aba5a113</a></p>",
      "company":"LaunchDarkly",
      "company_url":"http://LaunchDarkly",
      "company_logo":"http://github-jobs.s3.amazonaws.com/a92cf998-2dfd-11e8-8d21-f0ce4bd7e308.png",
      "url":"http://jobs.github.com/positions/ca37951c-2dfd-11e8-93dc-7ec30e6bc6df"},
    {"id":"624ab2c2-2eb1-11e8-9780-a2c6c677edec",
      "created_at":"Fri Mar 23 15:46:42 UTC 2018",
      "title":"Siri - Senior Search Engineer, International",
      "location":"San Francisco, CA",
      "type":"Full Time",
      "description":"<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Siri Search team is building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for.</p>\n\n<p>Siri’s universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As a this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day.</p>\n\n<p> </p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Hands on coding experience in one of the following languages: Python, Perl, Java, C++, Go</li>\n<li>Experience manipulating big-data for large information retrieval problems</li>\n<li>Experience with search indexing, web crawling, ranking preferred</li>\n<li>Working Knowledge of NLP and machine learning preferred</li>\n</ul><p>Description:\nThe Siri Search team is looking for software engineers who will play a central role in improving the quality of data and results ranking for international users of Siri Search in various languages and parts of the world.</p>\n\n<p>In joining our team, you would: Perform data mining to support new search features; Evaluate search results and identify indexing, ranking and relevance problems; Scope, Design and Implement solutions to problems specific to international and non-English-speaking users; Implement systems for normalizing across scripts and input methods; Present results of analysis to team and leadership across Apple. Our team provides Spotlight and Safari users results from the Internet (Maps, Apps, Media, Wiki, Apple's own Web index). Our team is small and rapidly growing, providing a startup environment but with the full resources and advantages of being a key part of Apple’s flagship products - including reaching a large and loyal user base. This means every member of our team gets to see the impact, within a few days of work they implement, on hundreds of millions of users.</p>\n\n<p>Education:\nBachelor's Degree in Computer Science, Information Science, Linguistics or equivalent work experience. Masters Degree a plus\n </p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n \nREQUISITION NUMBER: 113428740\nCOMPANY NAME: Apple Inc.</p>",
      "how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=3d6703d9554c79f2ace6db9750a5f7e9\">APPLY HERE</a></p>",
      "company":"Apple Inc.",
      "company_url":"http://www.apple.com",
      "company_logo":"http://github-jobs.s3.amazonaws.com/5fbf25d8-2eb1-11e8-9d82-46626baaf197.jpeg",
      "url":"http://jobs.github.com/positions/624ab2c2-2eb1-11e8-9780-a2c6c677edec"},
    {"id":"55004cae-2eb0-11e8-867a-99b24360684a",
      "created_at":"Fri Mar 23 15:44:49 UTC 2018",
      "title":"Engineering Manager (€80k/y + tokens)",
      "location":"Berlin",
      "type":"Full Time",
      "description":"<p>￼Want to help shape up the future of love? Luna, the blockchain powered dating platform, which completed its token sale beginning of this year, is hiring an Engineering Manager in Berlin. Our vision is to enable people to make meaningful connections.</p>\n\n<p>As Engineering Manager you’ll be choosing your own team and then build and scale the platform. This experience will be invaluable for your entire career. You will ship a world class app and support hyper-local product launches. </p>\n\n<p>We value continuous learning, clear communication and positive energy. We are building an inclusive environment for people from every background.</p>\n\n<p>About the Role:</p>\n\n<ul>\n<li>Take the dating platform from a demo to a full fledged service. </li>\n<li>Recruit, inspire, and build a high-performance team.</li>\n<li>Work closely with product leadership to prioritize initiatives to deliver the greatest value to the business.</li>\n<li>Drive architectural decisions, design, implementation, and operation of resilient distributed services.</li>\n<li>Split time evenly between hands-on coding and managing your team.</li>\n</ul><p>About you:</p>\n\n<ul>\n<li>Excellent knowledge and experience on a backend language, like Python (Django), Go, Node.js etc. Experience with React is a plus.</li>\n<li>Strong experience in handling ambiguous business requirements with excellent prioritization, time management abilities, and a focus on execution.</li>\n<li>Comfortable managing engineers working on any stack and make everyone feel included.</li>\n<li>You have designed, built, and scaled production systems or mobile applications.</li>\n<li>You love high quality code and good development processes and foster an environment that supports them.</li>\n</ul><p>As part of our team, you’ll enjoy:</p>\n\n<ul>\n<li>Working with an extraordinary team of smart, creative, fun and highly motivated people.</li>\n<li>Laptop and tools of your choice.</li>\n<li>Regular team lunches and awesome coffee.</li>\n<li>Competitive compensation and equity in tokens.</li>\n<li>Annual team retreat at a real castle. Burning Man style parties and glitter may ensure.</li>\n</ul>",
      "how_to_apply":"<p>Email <a href=\"mailto:martin@meetluna.com\">martin@meetluna.com</a> with a link to your Github and resume (Linkedin, Angellist etc)</p>",
      "company":"Luna",
      "company_url":"https://www.meetluna.com/",
      "company_logo":"http://github-jobs.s3.amazonaws.com/f64fef98-2eaf-11e8-93fc-cacfb37b6520.png",
      "url":"http://jobs.github.com/positions/55004cae-2eb0-11e8-867a-99b24360684a"
    }]
}